In [1]:
import mysql.connector as connector
import pandas as pd

In [2]:
try:

    connection = connector.connect(
        user = 'root',
        password = '******')

    print('Connected...')

except connector.Error as err:
    
    print('Error code: ', err.errno)
    print('Error message: ', err.msg)

Connected...

In [3]:
# 2 - Create a Cursor:

if connection.is_connected():
    cursor = connection.cursor(buffered=True)
    print('Cursor ready...')
else:
    print('It was not possible to create cursor as connection was not previously established...')

Cursor ready...

In [4]:
# 3 - Select database to manipualate:

use_database_query = "USE meta_py_to_mysql"
cursor.execute(use_database_query)

print('Your Database is: ', connection.database ) # confirm the name of the database in use

Your Database is:  meta_py_to_mysql

In [5]:
cursor.execute("SHOW TABLES")
for table in cursor:
    print(table)

('bookings',)
('menu_items',)
('menus',)
('orders',)

In [ ]:
# UPDATE
update_booking = """UPDATE bookings SET tableNo = 10 WHERE bookingID = 6"""
cursor.execute(update_booking)
connection.commit()

# SELECT

cursor.execute("""SELECT * FROM bookings ORDER BY bookingID""")
result_update = cursor.fetchmany(size=6)
columns_update = cursor.column_names

# Dataframe

df_update = pd.DataFrame(data=result_update,columns=columns_update)
df_update

   bookingID  tableNo guestFirstName guestLastName     bookingSlot  employeeID
0          1       12           Anna       Iversen 0 days 19:00:00           1
1          2       12         Joakim       Iversen 0 days 19:00:00           1
2          3       19        Vanessa      McCarthy 0 days 15:00:00           3
3          4       15         Marcos        Romero 0 days 17:30:00           4
4          5        5         Hiroki        Yamane 0 days 18:30:00           2
5          6       10          Diana         Pinto 0 days 20:00:00           5

In [ ]:
# DELETE

delete_booking = """DELETE FROM bookings WHERE bookingID = 4"""
cursor.execute(delete_booking)
connection.commit()

# SELECT 
cursor.execute("""SELECT * FROM bookings""")
afterDelete_result = cursor.fetchall()
afterDelete_columns = cursor.column_names

# DataFrame

df_afterDelete = pd.DataFrame(data=afterDelete_result, columns=afterDelete_columns)
df_afterDelete

   bookingID  tableNo guestFirstName guestLastName     bookingSlot  employeeID
0          1       12           Anna       Iversen 0 days 19:00:00           1
1          2       12         Joakim       Iversen 0 days 19:00:00           1
2          3       19        Vanessa      McCarthy 0 days 15:00:00           3
3          5        5         Hiroki        Yamane 0 days 18:30:00           2
4          6       10          Diana         Pinto 0 days 20:00:00           5